src/backend/src/tests/load_tests/users.yml
config:
  target: 'http://localhost:3333'
  phases:
    - duration: 60
      arrivalRate: 5
  payload:
    path: "usuarios.csv"
    fields:
      - "email"
      - "senha"
scenarios:
  - flow:
      - post:
          url: "/users/login"
          json:
            email: "{{ email }}"
            senha: "{{ senha }}"